{
	"Веб-приложение": "Один из видов программного обеспечения, используемого через браузер, работа которого основывается на использовании комбинации серверных и клиентских частей. Оно может быть написано на множестве языков программирования и работать на любой операционной системе.",
	"Уязвимость": "Участкок кода в приложении, которые потенциально может быть использованы злоумышленниками с цель нанесения вреда разработанной системе.",
	"Backend": "Серверная часть приложения, код которого скрыт от публичного доступа, выполняющая критически важную логику приложения.",
	"Frontend": "Клиентская часть приложения, с кодом открытом для каждого посетителя, результат которой представлен в виде пользовательского интерфейса.",
	"XSS": "Уязвимость, задача которой является выполнить вредоносный JavaScript-код у клиента.",
	"Небезопасны дизайн": "Ошибки в интерфейсе сайта, например, если пользователь заполнил форму авторизации с ошибками, то ему должно выводить «неверный логин и/или пароль», а не «неверный логин» или «неверный пароль». Так же к таким ошибка относят вывод ошибок непосредственно самого JavaScript. Данные уязвимости могу упростить злоумышленникам поиск слабых мест.",
	"SQL-инъекции": "Атака, направленная на базу данных, в результате которой злоумышленники отправляют свои SQL-запросы в БД",
	"Неправильная конфигурация": "Вид уязвимостей позволявшие злоумышленникам получить несанкционированный доступ к системным данным или функциям, а также могут привести к полной компрометации системы.",
	"SSRF": "Атака с подделкой запросов на стороне сервера, использующая функциональные возможностями сервера для доступа или изменения ресурсов. Злоумышленник нацелен на приложение, которое поддерживает импорт данных с URL-адресов или позволяет им читать данные с URL-адресов.",
	"CSRF": "Вид уязвимостей, связанный с frontend и backend частями веб-приложения, в результате которого пользователь не проверяет источник запросов и отправляет запросы на другой веб-сайт.",
	"Пентестинг": "Набор тестов на проникновение, целью которых является обнаружение уязвимостей в системе, при этом заранее известно, что ни одна система не защищена на 100%.",
	"Black box": "Вид тестирования, где тестировщик не имеет понятия о системе, его цель заключается в сборе информации. В этом тестировании специалист знает только то, каким должен быть ожидаемый результат, и он не знает, как он получается. Проверка программных кодов не осуществляется.",
	"White box": "Комплексное тестирование, так как тестировщику заранее предоставляется информация о системе и/или сети, например, исходный код, сведение об операционной системе, IP-адреса и т.д.",
	"Grey box": "Тип тестированию, где тестер обычно имеет частичную или ограниченную информацию о приложении. Этот тип можно рассматривать как атака злоумышленника, получивший доступ к частям системы.",
	"WAF": "Аппаратные или программные устройства, предназначенные для мониторинга трафика веб сайта, с возможность применения политики к транзакциям браузера сервера.  Чтобы отличить обычные запросы от несанкционированных запросов, WAF используют набор правил фильтрации в виде белых списков, черных списков или их комбинации.",
	"Веб-робот": "Программа для обхода и анализа веб-приложения. Может быть использована как в положительном ключе (поисковые работы), так и в негативном (пентестинг).",
	"Трафик веб-сайта": "Объём (количество) посетителей, пришедших на сайт из всех источников за определенный период времени."
}
